#
# ~/.bashrc
#

# =====================================================================
#  КАСТОМНАЯ НЕОНОВАЯ СТРОКА ПРИГЛАШЕНИЯ BASH (Юзер: mmrtrip)
# =====================================================================

# Цветовые коды под наш Vaporwave стиль
PINK="\[\033[1;35m\]"
PURPLE="\[\033[1;34m\]"
CYAN="\[\033[1;36m\]"
WHITE="\[\033[0;37m\]"
RESET="\[\033[0m\]"

# Сама строка: [Имя] в фиолетовом -> Папка в розовом -> Неоновая стрелка
PS1="${PURPLE}[${WHITE}\u${PURPLE}]${RESET} ${PINK}\w${RESET} ${CYAN}❯${RESET} "
fastfetch

alias ls='ls --color=auto'
alias grep='grep --color=auto'
